{
  "home": [
    {
      "title": "What services does Devtrios provide for businesses?",
      "desc": "Devtrios offers a comprehensive range of services, including custom software development, web development, mobile app development, cloud hosting, AI solutions, UI/UX design, and digital marketing."
    },
    {
      "title": "How can Devtrios help with business growth and digital transformation?",
      "desc": "Devtrios supports businesses by offering scalable technology solutions that streamline operations, automate processes, and improve customer engagement to drive long-term growth."
    },
    {
      "title": "Which industries does Devtrios serve with its technology solutions?",
      "desc": "We serve industries such as e-commerce, healthcare, financial services, education, and logistics by delivering industry-specific solutions tailored to their needs."
    },
    {
      "title": "What makes Devtrios different from other technology providers?",
      "desc": "Devtrios stands out due to its use of cutting-edge technologies, custom-tailored solutions, and a proven track record of delivering scalable, high-quality software on time."
    },
    {
      "title": "Does Devtrios offer ongoing support and maintenance for projects?",
      "desc": "Yes, we provide long-term maintenance and support for all projects, including regular updates, performance optimizations, and software scalability improvements to meet evolving business needs."
    }
  ],
  "services": [
    {
      "title": "What services does Devtrios provide for businesses?",
      "desc": "Devtrios offers a comprehensive range of services, including custom software development, web development, mobile app development, cloud hosting, AI solutions, UI/UX design, and digital marketing."
    },
    {
      "title": "How can Devtrios help with business growth and digital transformation?",
      "desc": "Devtrios supports businesses by offering scalable technology solutions that streamline operations, automate processes, and improve customer engagement to drive long-term growth."
    },
    {
      "title": "Which industries does Devtrios serve with its technology solutions?",
      "desc": "We serve industries such as e-commerce, healthcare, financial services, education, and logistics by delivering industry-specific solutions tailored to their needs."
    },
    {
      "title": "What makes Devtrios different from other technology providers?",
      "desc": "Devtrios stands out due to its use of cutting-edge technologies, custom-tailored solutions, and a proven track record of delivering scalable, high-quality software on time."
    },
    {
      "title": "Does Devtrios offer ongoing support and maintenance for projects?",
      "desc": "Yes, we provide long-term maintenance and support for all projects, including regular updates, performance optimizations, and software scalability improvements to meet evolving business needs."
    }
  ],
  "website_development": [
    {
      "title": "How long does a website development project take?",
      "desc": "Most website development projects take between 4 to 8 weeks, depending on complexity, features, and integrations. Larger or custom platforms may require additional time."
    },
    {
      "title": "Do you build SEO into your website development?",
      "desc": "Yes. SEO is integrated into every website we build, including clean site architecture, mobile optimisation, performance best practices, and SEO-friendly page structures."
    },
    {
      "title": "Can you redesign or rebuild an existing website?",
      "desc": "Absolutely. We regularly rebuild or redesign existing websites to improve performance, usability, and conversions while preserving valuable SEO equity where possible."
    },
    {
      "title": "Which platforms do you use for website development?",
      "desc": "We work with platforms such as WordPress, Shopify, Webflow, and fully custom solutions depending on your requirements, scalability needs, and long-term goals."
    },
    {
      "title": "Do you provide ongoing website support after launch?",
      "desc": "Yes. We offer website maintenance and support services to ensure your site remains secure, updated, and optimised as your business grows."
    }
  ],
  "ecommerce_website_development": [
    {
      "title": "How long does an e-commerce website project take?",
      "desc": "Most e-commerce projects take between 6 and 10 weeks, depending on platform, catalogue size, and integrations."
    },
    {
      "title": "Which e-commerce platform should I use?",
      "desc": "That depends on your business model, growth plans, and operational complexity. We help you choose the right platform."
    },
    {
      "title": "Can you rebuild or improve an existing e-commerce store?",
      "desc": "Yes. We regularly rebuild or optimise existing stores to improve performance, usability, and conversions."
    },
    {
      "title": "Do you provide ongoing e-commerce support?",
      "desc": "Yes. We offer ongoing maintenance, optimisation, and feature development."
    }
  ],
  "wordpress_development": [
    {
      "title": "How long does a WordPress website project take?",
      "desc": "Most WordPress website projects take between 4–8 weeks, depending on complexity, third-party integrations, and content readiness. Larger or highly customized builds may require additional time. We define clear milestones and timelines during the discovery phase."
    },
    {
      "title": "Do you use pre-built themes or custom WordPress themes?",
      "desc": "We primarily develop custom WordPress themes tailored to your business needs. Custom themes provide better performance, stronger security, cleaner code, and long-term flexibility compared to pre-built themes."
    },
    {
      "title": "Is WordPress suitable for large or enterprise websites?",
      "desc": "Yes. When properly architected, WordPress can support enterprise-level traffic, complex content structures, and advanced integrations. We design scalable solutions using best practices to ensure stability, speed, and security at scale."
    },
    {
      "title": "Do you provide ongoing WordPress maintenance?",
      "desc": "Yes. We offer ongoing WordPress maintenance services, including security monitoring, regular updates, backups, performance optimization, and technical support to keep your website running smoothly."
    }
    
  ],
  "shopify_development": [
    {
      "title": "How long does a Shopify development project take?",
      "desc": "Most Shopify projects take between 4 and 8 weeks, depending on catalogue size, customisation, and integrations."
    },
    {
      "title": "Do you build custom Shopify themes or use templates?",
      "desc": "We primarily build custom or heavily customised themes to ensure performance, flexibility, and brand consistency."
    },
    {
      "title": "Can you migrate my store to Shopify?",
      "desc": "Yes. We handle full Shopify migrations, including products, customers, orders, and SEO-safe URL mapping."
    },
    {
      "title": "Do you offer ongoing Shopify support?",
      "desc": "Yes. We provide ongoing maintenance, performance optimisation, updates, and feature enhancements."
    }
  ],
  "mobile_app_development": [
    {
      "title": "How long does a mobile app development project take?",
      "desc": "Most mobile app projects take between 8 and 16 weeks, depending on features, integrations, and platform requirements."
    },
    {
      "title": "Do you build native or cross-platform apps?",
      "desc": "We build both. The choice depends on performance needs, timelines, and long-term scalability."
    },
    {
      "title": "Can you improve or rebuild an existing mobile app?",
      "desc": "Yes. We regularly rebuild and optimise existing apps to improve performance, usability, and stability."
    },
    {
      "title": "Do you handle App Store and Play Store submissions?",
      "desc": "Yes. We support app preparation, compliance, and submission for both platforms."
    }
  ],
  "software_development": [
    {
      "title": "How long does a custom software development project take?",
      "desc": "Project timelines vary based on complexity and scope. Custom software development typically takes 8–16 weeks, with larger enterprise solutions requiring more time."
    },
    {
      "title": "What technologies do you use for custom software development?",
      "desc": "We work with a wide range of technologies including React, Node.js, Python, Java, and Ruby on Rails to build scalable, secure, and high-performance applications."
    },
    {
      "title": "Can you help me migrate my existing software to a new platform?",
      "desc": "Yes. We specialize in migrating legacy systems to modern platforms with minimal disruption and data loss. We ensure data integrity and continuity during the migration process."
    },
    {
      "title": "Will I be able to update and maintain the software myself?",
      "desc": "Yes. We ensure the software is easy to maintain with a user-friendly backend and provide training to your team to manage the platform independently."
    },
    {
      "title": "Do you provide ongoing support after the software is launched?",
      "desc": "Yes. We offer continuous support, including bug fixes, updates, and feature expansions, to ensure your software remains secure and relevant."
    }
  ],
  "landing_page_development": [
    {
      "title": "How long does it take to build a landing page?",
      "desc": "Most landing pages are completed within 1 to 2 weeks, depending on complexity and feedback cycles."
    },
    {
      "title": "Do you design landing pages for paid ads?",
      "desc": "Yes. We build landing pages specifically aligned to Google Ads, Meta Ads, and LinkedIn campaigns."
    },
    {
      "title": "Can you optimize an existing landing page?",
      "desc": "Absolutely. We regularly optimize existing landing pages to improve speed, usability, and conversion rates."
    },
    {
      "title": "Do you provide A/B testing support?",
      "desc": "Yes. We support ongoing testing and optimisation based on performance data."
    }
  ],
  "website_maintenance": [
    {
      "title": "Why do I need ongoing website maintenance?",
      "desc": "Regular maintenance prevents security issues, performance degradation, and compatibility problems before they affect users or rankings."
    },
    {
      "title": "How often do you perform updates?",
      "desc": "Updates are performed on a scheduled basis, with priority fixes applied immediately when needed."
    },
    {
      "title": "Can you fix an already compromised website?",
      "desc": "Yes. We handle malware removal, recovery, and security hardening as part of our support services."
    },
    {
      "title": "Do you provide emergency support?",
      "desc": "Yes. Our maintenance plans include rapid-response support for critical issues."
    },
    {
      "title": "Can you maintain websites built by other agencies?",
      "desc": "Absolutely. We regularly take over maintenance for existing websites built on various platforms."
    }
  ],
  "custom_website_development": [
    {
      "title": "How long does a custom website project take?",
      "desc": "Most custom website projects take between 6 and 10 weeks, depending on complexity and integrations."
    },
    {
      "title": "Will we own the website code?",
      "desc": "Yes. You retain full ownership of the codebase and intellectual property."
    },
    {
      "title": "Can our team manage content after launch?",
      "desc": "Absolutely. We build intuitive CMS solutions and provide training where required."
    },
    {
      "title": "Do you build SEO-ready custom websites?",
      "desc": "Yes. Technical SEO is built into every custom project from the start."
    },
    {
      "title": "Do you provide ongoing support?",
      "desc": "Yes. We offer ongoing maintenance and development support post-launch."
    }
  ],
  "webflow_development": [
    {
      "title": "How long does a Webflow website take to build?",
      "desc": "Most Webflow projects take between 3 and 6 weeks, depending on complexity and CMS requirements."
    },
    {
      "title": "Can you migrate my existing site to Webflow?",
      "desc": "Yes. We handle full Webflow migrations while preserving SEO and content structure."
    },
    {
      "title": "Is Webflow good for SEO?",
      "desc": "Yes. When built correctly, Webflow supports clean markup, fast load times, and strong technical SEO foundations."
    },
    {
      "title": "Do you offer ongoing Webflow support?",
      "desc": "Yes. We provide maintenance, optimisation, and ongoing enhancements."
    }
  ]
}
