{
    "heading": {
      "title": "Featured Work",
      "description": "A selection of WordPress projects that highlight our approach to performance, stability, and clean engineering. Each project reflects the level of technical depth and reliability we bring to client partnerships."
    },
    "projects": [
      {
        "title": "Fairagora Asia",
        "industry": "Sustainability and Agriculture",
        "summary": "Complete WordPress rebuild with improved UX, structured content hierarchy, and performance-focused architecture.",
        "technicalFocus": "Custom theme, multilingual SEO configuration, schema setup, caching improvements, accessibility corrections.",
        "image": "/assets/images/services/fullstack-back.webp",
        "results": [
          "Page load time improved from 3.9 seconds to 1.4 seconds",
          "Organic visibility increased by 36 percent over 90 days",
          "Bounce rate reduced by 22 percent",
          "Admin workflow time reduced by 40 percent due to CMS restructuring"
        ]
      },
      {
        "title": "LogicMark",
        "industry": "Medical Technology",
        "summary": "Modernised WordPress platform aligned with updated brand requirements and streamlined navigation.",
        "technicalFocus": "Accessibility improvements, mobile responsiveness upgrades, technical SEO corrections.",
        "image": "/assets/images/services/backend-back.webp",
        "results": [
          "PageSpeed score improved from 54 to 89",
          "Engagement time increased by 31 percent",
          "Clearer content paths for key product pages"
        ]
      },
      {
        "title": "NNFCC",
        "industry": "Bioeconomy Consultancy",
        "summary": "Long-term WordPress maintenance, code cleanup, plugin rationalisation, and improved content management workflows.",
        "technicalFocus": "Security hardening, reduced plugin footprint, backend optimisation.",
        "image": "/assets/images/services/frontend-back.webp",
        "results": [
          "Plugin set reduced by 28 percent",
          "Zero downtime over nine months",
          "Improved CMS efficiency for internal content teams"
        ]
      },
      {
        "title": "HealthPro Clinic Portal",
        "industry": "Healthcare",
        "summary": "HIPAA-ready WordPress site with online appointment scheduling and secure patient resource access.",
        "technicalFocus": "HIPAA compliance, secure patient portal, appointment booking system.",
        "image": "/assets/images/services/api-back.webp",
        "results": [
          "Administrative hours reduced by approximately 15 hours per month",
          "Appointment booking conversions increased by 19 percent",
          "Added custom security layer for protected pages"
        ]
      },
      {
        "title": "RetailMax E-commerce Store",
        "industry": "Retail and E-commerce",
        "summary": "Custom WooCommerce implementation with subscription support, refined product search, and optimised checkout flow.",
        "technicalFocus": "Custom WooCommerce development, subscription management, checkout optimization.",
        "image": "/assets/images/services/fullstack-back.webp",
        "results": [
          "Checkout abandonment decreased by 24 percent",
          "Average order value increased by 11 percent",
          "Page load times improved from 4.1 seconds to 1.7 seconds"
        ]
      },
      {
        "title": "TechNova SaaS Marketing Site",
        "industry": "SaaS and Technology",
        "summary": "Performance-optimised WordPress site built for rapid indexing, lightweight code, and strong marketing conversion paths.",
        "technicalFocus": "Performance optimization, SEO-focused architecture, conversion optimization.",
        "image": "/assets/images/services/backend-back.webp",
        "results": [
          "Demo sign-ups increased by 40 percent within 60 days",
          "Organic impressions increased by 29 percent",
          "Blog performance improved with caching and code refinement"
        ]
      }
    ]
  }